app/Controllers/Orang.php

SELECT *
FROM `orang`
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `orang`
---
    public function index()
    {
        $currentPage = $this->request->getVar('page_orang') ? $this->request->getVar('page_orang') : 1;
        // cari bedasarkan keyword
        $keyword= $this->request->getVar('keyword');
        if($keyword){
            $orang = $this->OrangModel->search($keyword);
            }else{
                $orang = $this->OrangModel;
            }

        $data = [
            'title' => 'Daftar Orang | Laito',
            'orang' => $orang->paginate(6,'orang'),